{"data":{"site":{"siteMetadata":{"title":"thinking...","subtitle":"learning how to learn","copyright":"© All rights reserved.","author":{"name":"Patrick McCaffrey","twitter":"pmccaffry"},"disqusShortname":"","url":"https://musedivision.github.io/blog"}},"markdownRemark":{"id":"183b3656-923f-598a-8b2d-8d5a8f15721d","html":"<!-- ![daniel hertzberg](./daniel_hertzberg_artificial_intelligence_with_human_feelings.jpg) -->\n<p>I am embarking on an ambitious learning project for the next 3 months:<br>\nLearning deep learning and the mathematics behind it by studying only online resources such as fastai, MIT opencourseware and YouTube. </p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/f76b746f06c2356931222de816f32297/b97fe/trinity_lib.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 960px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 75%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAPABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIDBP/EABYBAQEBAAAAAAAAAAAAAAAAAAECA//aAAwDAQACEAMQAAABxy0JGjERP//EABoQAAMAAwEAAAAAAAAAAAAAAAABEQIDEiL/2gAIAQEAAQUC4hjjWtXSrKe0f//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABcQAQADAAAAAAAAAAAAAAAAABAAITH/2gAIAQEABj8Cbmn/xAAaEAEAAwEBAQAAAAAAAAAAAAABABExIVFB/9oACAEBAAE/IbDhMUvsrV8jTjphEfF5HEbn/9oADAMBAAIAAwAAABATz//EABURAQEAAAAAAAAAAAAAAAAAAAAR/9oACAEDAQE/EFf/xAAVEQEBAAAAAAAAAAAAAAAAAAAAEf/aAAgBAgEBPxBH/8QAGhABAAMBAQEAAAAAAAAAAAAAAQARITFRwf/aAAgBAQABPxBZ0qg6tdjPaDQxLPYDbhgsIJy77CmRNJiP2NgQQRup/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"placeholder photo\"\n        title=\"\"\n        src=\"/static/f76b746f06c2356931222de816f32297/b3ee8/trinity_lib.jpg\"\n        srcset=\"/static/f76b746f06c2356931222de816f32297/3bc27/trinity_lib.jpg 240w,\n/static/f76b746f06c2356931222de816f32297/98431/trinity_lib.jpg 480w,\n/static/f76b746f06c2356931222de816f32297/b3ee8/trinity_lib.jpg 960w,\n/static/f76b746f06c2356931222de816f32297/b97fe/trinity_lib.jpg 1440w\"\n        sizes=\"(max-width: 960px) 100vw, 960px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<h2>Why deep learning?</h2>\n<p>Deep learning is cool! Its like particle physics in the early 20th Century crossed with the advent of Personal computers in the late 70s.\nNew and exciting frontiers are open to discover the fundamental building blocks of intelligence and the barrier to entry is just a computer with access to the internet. It feels like a unique moment in human history.</p>\n<p>Everyday there is a new article about “AI”, read deep learning, being implemented to revolutionise everything from Snapchat filters to driverless cars. It feels like the next big thing. Deep learning gives you a power to create applications that were practically impossible with handcrafted systems. Not only that but the field is only few years old. What an exciting prospect to be able to get into a new and exciting intellectual field when things are just taking off. It’s like a shiny new toy to play with.</p>\n<!-- The research is programming heavy therefore I already have some of the prerequistite skills.  -->\n<h2>Starting from Zero</h2>\n<p>Deep learning is supposed to be very difficult and math heavy field. Programming is definitely a prerequisite to actually implementing Deep Learning. Mathematics, specifically university level linear algebra and caclulus is also said to be a must have. </p>\n<p>I am kinda zero in the mathematics regard, my background isn’t in machine learning or mathematics.  I studied Psychology for 4 years at University but only ever took a couple of papers in statistics. It felt very foreign to me until recently. I discoverd Jeremy Khun’s book: Programmer’s introdution to Mathematics (PIM). Reading PIM and watching 3Brown1Blue has opened my eyes to the beauty of maths and excited to learn more of it.</p>\n<!-- Maybe more importantly, I really believe I can learn mathematics even though it was never my strength before.  -->\n<p>I am a Javascript developer by trade, so I think I pass the programming prerequisite. Three years ago I was working the most boring job ever, stocking taking chemicals in University labs and putting the data into excel. I was really motivated to do something else, so I quit my job and studied coding using Freecodecamp (ref) for 8months. I was lucky enough to get my first break at Forsite(link). Fast forward to now and I have been coding professionally for 2 years and I love it. </p>\n<h2>Learning</h2>\n<p>Deep learning and the mathematics involved is probably much more complex than web development and javascript. But I have been down this path before and I know its possible. That (and reading a few success stories on Medium) helps to give you confidence during the long periods of frustration and confusion that you will find a way out.   </p>\n<p>But how do you find your way out? When I first learn’t code I developed some strategies over time like building projects, taking regular breaks and always searching google. These worked, but I would still struggle to digest concepts. Overall the process was still a bit haphazard, lots of forgetting then relearning stuff.</p>\n<p>This time around I want to take a more active and methodical approach to learning. Theres lots of decisions I will make about what and how to learn different content(What is the best way to learn Mathematics?). By writing I want to share my experience with what works. I am excited to add Anki, a spaced repetition tool, to my learning tool kit. More on that later. </p>\n<p>Through the learning there is always <em>Imposter Syndrome</em>. Some days you have a few eurekas, solve problems and you really feel like you can learn anything. Other times its frustrating, nothing makes sense, your motivation wanes and the magnitude of what you still don’t know feels insurmountable. I still felt like an imposter some days doing Javascript.  So why not feel like an imposter doing deep learning?</p>\n<h2>So naïve</h2>\n<p>If you look at any job add for a Deep Learning Research Engineer it will probably say: “requires Master/ PhD in Statistics or Comp Sci”. You also see a similar thing for developer Jobs “requires Bachelors in Comp Sci”.   </p>\n<p>Can you really learn in 3 months what takes a PhD student years? </p>\n<p>I don’t think you need a PhD. Just like you don’t need a BSc in CompSci to get a developer job.<br>\nI also think you really can learn what a Deep Learning PhD student knows outside of academia. Ok I admit the goal is a little preposterous in 3 months. I am willing to budge on the time factor, but I don’t think you need 3 - 5 years to get there. </p>\n<p>I may have gotten the wrong idea from Jeremy Howard and Rachel Thomas (ref). I found their deep learning for coders course in 2017 <a href=\"#ref_6\"><sup>6</sup></a> and took from it the idea that it was possible to learn math even if you were not good at it before <strong>AND</strong> that its possible to make meaningful contributions to deep learning research even if you didn’t do a PhD in Math.</p>\n<p>With that blissful ignorance about the difficulty we can happily skip into my plan ⬇️</p>\n<h1>🧳 The Plan</h1>\n<p>I hope to build a strong foundational knowledge in the practical methods for building deep learning systems and the mathematics involved. From there I want to build working state of the art models from scratch and understand them.</p>\n<p>Beside each course you’ll see a number which is my arbitrary Full Time Effort metric.<br>\n<strong>1 point</strong> being the full focus of a university paper for <strong>1 semester</strong> ( ~ 12 weeks ).\nOf course it is arbitrary, but my idea behind this is to quantify, like in Scrum (ref), the complexity of AND effort I will spend on each course. Basically the less effort the more content I will skip from the course.</p>\n<p>The plan comes out to about 7.5 points. By the above definition this is nearly twice the amount of work I can fit into 12 weeks. I dont know what will turn out to be the most important resource, I expect I will change direction at some point in the journey.\nLets see what happens…</p>\n<h3>Machine Learning and Deep learning</h3>\n<table>\n<thead>\n<tr>\n<th align=\"left\"><code class=\"language-text\">Course/Book</code></th>\n<th>FTE</th>\n<th>Cost</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\"><code class=\"language-text\">Fastai</code></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- Practical Deep Learning for Coders Part 1 (2019)</td>\n<td>1.5</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- Deep Learning Part 2 (2019) (not released yet)</td>\n<td>1.5</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\"><code class=\"language-text\">Deeplearning.ai</code></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- Deep learning specialization<a href=\"#ref_1\"><sup>1</sup></a></td>\n<td>0.5</td>\n<td><em>$45</em></td>\n</tr>\n<tr>\n<td align=\"left\"><code class=\"language-text\">Jeremy Khun</code></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- Programmers Introduction to Mathematics Book <a href=\"#ref_2\"><sup>2</sup></a></td>\n<td>0.5</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\"><code class=\"language-text\">MIT</code></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- XXXX Single Variable Calculus</td>\n<td>0.2</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- 18.02 Multivariable Calculus</td>\n<td>0.4</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- 18.06 Linear Algebra</td>\n<td>0.7</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- 18.065 Matrix Methods in Data analysis, signal processing and machine learning</td>\n<td>0.7</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\"><code class=\"language-text\">3Blue1Brown</code></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- Essence of Linear Algebra &#x26; Calculus</td>\n<td>0.5</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\"><code class=\"language-text\">Khan Academy</code></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- Linear Algebra &#x26; Calculus</td>\n<td>0.3</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\"><code class=\"language-text\">Udemy</code></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">- Swift - iOS app development <a href=\"#ref_3\"><sup>3</sup></a></td>\n<td>0.3</td>\n<td>$11</td>\n</tr>\n<tr>\n<td align=\"left\">- Python for data science and machine learning <a href=\"#ref_4\"><sup>4</sup></a></td>\n<td>0.3</td>\n<td>$11</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td>.</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\"><code class=\"language-text\">Resources</code></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">GPU server instance  - AWS p2 instance &#x3C;200 hours<a href=\"#ref_5\"><sup>5</sup></a></td>\n<td></td>\n<td>~$300</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td>.</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td>.</td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">Total</td>\n<td>7.4</td>\n<td>~$367</td>\n</tr>\n</tbody>\n</table>\n<hr>\n<h2>📜 Do you get a certificate?</h2>\n<p>I get asked this question by alot by friends and family when I tell them my plan.</p>\n<p>The answer is No.\nWhile I will get a certificate for completing deeplearning.ai (because I paid), I don’t trust this will be enough proof for anyone. Especially as you can see above that this certificate will only account for a small amount of my overall learning.</p>\n<p>When I first learnt to code my certificate was my projects. At the time people had not heard of FreeCodeCamp, so their certificates were not worth much and I only earn’t one of 4 certificates. The projects I built during the FreeCodeCamp curriculum were however undeniable proof. Github was the proof. You can hire me to write <em>javascirpt to build websites</em>, because here, I have built websites using javascript.</p>\n<p>Rightly or wrongly I will follow this philosophy for deep learning.\nModels in production with code on Github, implementing papers in code and technical writing will be my certificate of proficiency for deep learning.</p>\n<h2>Why not do a Masters?</h2>\n<p>Good question. I would have the chance to basically do what I am doing but in a more supported environment with capable peers to collaborate with and learn from etc. </p>\n<p>I am not sure if I could get straight into a program without any compsci degree. Apart from that, there are three reasons:</p>\n<p><strong>The cost:</strong><br>\nA Masters in NZ would cost at least 10k plus the opportunity cost of one years income. If I study online I can cut this cost greatly and probably get access to on par course content from places like MIT open courseware. </p>\n<p><strong>Low Risk</strong><br>\nThree months study wont cost much and it is less of a risk. There are alot of unknowns when switching to a new field of programming. In three months I can figure out if I actually like machine learning. Committing to a whole year of a Masters is big gamble when I am unsure if it is a good fit (ha).\nIn the end if its not for me, well I can get a job writing Javascript again 🤷‍♂️ </p>\n<p><strong>The Cutting edge is online</strong><br>\nI don’t want to learn matlab, or R. It seems to me that University Academia can very often be behind the cutting edge of Computer Science. Many of the things a Comp Sci grad needs for a developer job they will learn outside of uni.<br>\nI think we are in a unique moment in history:  the field of machine learning has a majority of advanced content avaliable for free on the internet (e.g <a href=\"https://paperswithcode.com/\">paperswithcode</a>)</p>\n<!-- ## 🤔 You dont know what you dont know\n\nI have done something like this before when I learnt to code. When you are learning a completely new field, the path ahead of you keeps changing as you understand more. I have my ideas of what it is going to be like, what the best resources are and how to I should learn.  \nBut, I am sure I will be wrong alot. I am happy to be wrong, even it can take a while to accept. \n\nAt the end of 3 months at least I will have a pretty good idea of what I don’t know.  -->\n<h2>🧠 Anki and Michael Neilson</h2>\n<p>I was super inspired by a great post by Michael Neilson on augmenting your cognition </p>\n<p><a href=\"http://augmentingcognition.com/ltm.html\">augementing cognition</a></p>\n<p>I am excited to try and apply his strategies to my learning process over the next three months. Micheal advocates using the Anki (link) application and method to be remember more of what you spend your time learning. Anki is an open source spaced repetition flash card app (ref). You add questions and answers and each time you practice a card you answer how difficult you found it to remember ( bad, good, easy ). Anki then uses the an algorithm based on the forgetting curve (ref) to remind you to rehearse this card at the optimal time solidify it as a long term memory. </p>\n<p>The main goal studying over the next 3 months is to remember what I learn. As Micheal says: <em>“Anki makes memory a choice, rather than a haphazard event, to be left to chance”</em>. It is a seductive idea. That by using Anki you can have a better memory and therefore be more efficient with the time you spend learning.</p>\n<!-- \nMicheal has also written about anki as a good method for gaining deeper understanding of mathematic theorems. Obviously that is relevant to my current endeavour.\nI have used anki a small amount, but plan to experiement alot during studies with most effective ways for me to learn new things.  -->\n<p>My biggest takeway from reading Micheal’s post was his advice for starting to use Anki. And I would repeat it for anyone who is interested in trying it out. <em>“Cultivate a taste in what to Ankify”</em>. You should try to learn and understand what kind of information works well as anki cards, when in the learning process you should add it to Anki and how to best write cards for different types of information. During my learning journey I plan to put alot of time into experiementing with the best ways to use Anki to make my learning more efficient.</p>\n<!-- For example, I find again and again, that if I dont understand something putting it in Anki doesn't help. I just get reminded everyday that I dont understand. I find it best to ankify only when you hit the eureka moment of understanding what is happening, then I write better cards and I solidify that moment of understanding that I might have forgotten otherwise.  -->\n<p>I hope to share my experiences with using Anki in future. </p>\n<figure>\n\t<blockquote>\n\t\t<p>Cultivate a taste in what to Ankify</p>\n\t\t<footer>\n\t\t\t<cite>— Michael Nielsen</cite>\n\t\t</footer>\n\t</blockquote>\n</figure>\n<h2>Why I wrote this post?</h2>\n<p>I was a little terrified to write this blog post ( so many revisions 😫 ).\nMy main motivation comes from the advice of Rachel Thomas and Jeremy Howard. The sentiment of sharing your knowledge even if you are a beginner in a subject.</p>\n<figure>\n\t<blockquote>\n\t\t<p>You have a unique perspective that is valuable for someone who is just behind you in the learning process</p>\n\t\t<footer>\n\t\t\t<!-- <cite>— Rachel Thomas & Jeremy Howard</cite> -->\n\t\t</footer>\n\t</blockquote>\n</figure>\n<p>If you are thinking about breaking in to deep learning, I think you can do it. </p>\n<p>Thanks for reading, Hope you found it interesting.<br>\nhit me up on twitter ✌️</p>\n<hr>\n<p><a id=\"ref_1\"><sup>1</sup></a> <em>I intend to take the deeplearning.ai course as supplement to fastai practical deep learning courses</em><br>\n<a id=\"ref_2\"><sup>2</sup></a> <em>This book got me excited about the ideas and magic of mathematical proofs and the beauty behind it. It has helped to change my view of mathematics. I think of it like a foundational perspective on the subject, rather than a rigorous course to teach me many subjects.</em><br>\n<a id=\"ref_3\"><sup>3</sup></a> <em>Swift for Tensorflow seems important (ref)</em><br>\n<a id=\"ref_4\"><sup>4</sup></a> <em>To fill out some my practical knowledge of the python datascience ecosystem matplotlib, numpy etc.</em><br>\n<a id=\"ref_5\"><sup>5</sup></a> <em>Unknown how much this will cost as you can also use Google Colab with a GPU/TPU for free!</em><br>\n<a id=\"ref_6\"><sup>6</sup></a> <em>When I found the course I was actually searching for resources to learn about AWS and the first course included alot fiddily bits about setting up a GPU on AWS. Which I loved</em><br>\n<a id=\"ref_8\"><sup>8</sup></a> <em>Deep learning specifically, not neural networks or machine learning generally</em></p>","fields":{"tagSlugs":["/tags/deep-learning/","/tags/learning/","/tags/mathematics/"]},"frontmatter":{"title":"Zero to Deep learning","tags":["Deep Learning","Learning","mathematics"],"date":"2019-05-02T22:40:32.169Z","description":"Quit job. Study 3 months. Become Deep learning researcher. "}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/3months-to-deep-learning/"}}